In [2]:
import pandas as pd
import numpy as np

rng = np.random.RandomState(42)

In [12]:
A = rng.randint(10, size=(3, 4))
A

array([[5, 2, 0, 2],
       [4, 2, 0, 4],
       [9, 6, 6, 8]], dtype=int32)

In [13]:
A - A[0]

array([[ 0,  0,  0,  0],
       [-1,  0,  0,  2],
       [ 4,  4,  6,  6]], dtype=int32)

In [14]:
df = pd.DataFrame(A, columns=list('QRST'))

df

   Q  R  S  T
0  5  2  0  2
1  4  2  0  4
2  9  6  6  8

In [15]:
df - df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1 -1  0  0  2
2  4  4  6  6

In [16]:
df.subtract(df['R'], axis=0)

   Q  R  S  T
0  3  0 -2  0
1  2  0 -2  2
2  3  0  0  2

In [ ]:
halfrow = df.iloc[0, ::2]
halfrow